; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 174118 2 3 3 4 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	image1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(have_image Planet4 image1)
	(have_image Phenomenon5 image1)
	(have_image Star6 image0)
	(have_image Star7 image1)
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
4. (turn_to satellite1 groundstation2 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 6
7. (turn_to satellite0 star7 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star7)
   goals met: 0 of 6
8. (turn_to satellite1 phenomenon8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 6
9. (take_image satellite0 star7 instrument0 image1)
   added: (have_image star7 image1)
   goals met: 1 of 6
10. (take_image satellite1 phenomenon8 instrument1 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 2 of 6
11. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 2 of 6
12. (take_image satellite0 star6 instrument0 image0)
   added: (have_image star6 image0)
   goals met: 3 of 6
13. (turn_to satellite0 planet4 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet4)
   goals met: 3 of 6
14. (take_image satellite0 planet4 instrument0 image1)
   added: (have_image planet4 image1)
   goals met: 4 of 6
15. (turn_to satellite0 phenomenon5 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 6
16. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 5 of 6
17. (turn_to satellite0 star9 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star9)
   goals met: 5 of 6
18. (take_image satellite0 star9 instrument0 image0)
   added: (have_image star9 image0)
   goals met: 6 of 6
